/* Description for disconnection warning setting */
"1 Minute Alert Before Disconnection" = "Báo động 1 phút trước khi tắt đường nối";

/* Error string for OTR message string */
"A private conversation could not be set up." = "A private conversation could not be set up.";

/* Title for the about page */
"About" = "Dịch bởi vietnamesel10n";

/* Label for button to show version numbers and licenses */
"About This Version" = "About This Version";

/* SSL error message */
"Access denied" = "Từ chối truy cập";

/* The string describing a buddy's account */
"Account" = "Tài Khoản";

/* Error title when account is disconnected */
"Account Disconnected" = "Account Disconnected";

/* Title for showing the users account otr fingerprints */
"Account Fingerprints" = "Dấu tay của Tài khoản";

/* Title for the accounts tab */
"Accounts" = "Tài khoản";

/* Button title to add someone as a buddy */
"Add" = "Thêm";

/* The title for the view to add a buddy */
"Add Buddy" = "Thêm Bạn";

/* String to describe advanced set of settings */
"Advanced" = "Cao cấp";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "An error occured while encrypting a message and the message was not sent.";

/* shown when changing database passphrase fails */
"An error occurred while changing the database passphrase." = "An error occurred while changing the database passphrase.";

/* Error message when setting up database */
"An error occurred while setting up the database." = "An error occurred while setting up the database.";

/* SSL error message */
"Attempt to restore an unknown session" = "Tìm cách phục hồi một phiên không rõ";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Tự động-xóa";

/* string for title yes/no setting for allowing opportunistic otr */
"Auto-start Encryption" = "Tự động kích hoạt chế độ mã hóa";

/* Label in buddy list for users that are available */
"Available" = "Đang online";

/* Label in buddy list for users that are away */
"Away" = "Không có trên máy";

/* Message displayed in Notification Manager when session will expire in one minute */
"Background session will expire in one minute." = "ChatSecure sẽ chấm dứt trong vòng 1 phút";

/* SSL error message */
"Bad certificate format" = "Chứng chỉ không đúng dạng";

/* SSL error message */
"Bad MAC" = "MAC không đúng";

/* SSL error message */
"Bad protocol version" = "Phiên bản giao thức không đúng";

/* SSL error message */
"Bad SSLCipherSuite" = "SSLCipherSuite không đúng";

/* SSL error message */
"Bad unsupported cert format" = "Dạng chứng chỉ không được hỗ trợ và không đúng";

/* string to describe basic set of settings */
"Basic" = "Căn bản";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords.";

/* The String for a button to block a buddy */
"Block" = "Chận";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Chận & Tháo Bỏ";

/* Title for showing the users buddies otr fingerprints */
"Buddy Fingerprints" = "Dấu tay của Bạn Bè";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Chi Tiết Bạn";

/* Title for the buddy list tab */
"Buddy List" = "Danh sách bạn bè";

/* Cancel an alert window */
"Cancel" = "Hủy Bỏ";

/* Shown when ending an encrypted chat session */
"Cancel Encrypted Chat" = "Hủy chat có mã hóa";

/* Error string for OTR message string */
"Cannot read the received message." = "Cannot read the received message.";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Cannot recognize the type of OTR message received.";

/* SSL error message */
"Cert chain not verified by root" = "Chuỗi chứng chỉ chưa kiểm chứng bởi root";

/* SSL error message */
"Certificate expired" = "Chứng chỉ hết hạn";

/* SSL error message */
"Certificate revoked" = "Chứng chỉ bị thu hồi";

/* SSL error message */
"Chain had a cert not yet valid" = "Chuỗi có chứng chỉ chưa hợp lệ";

/* SSL error message */
"Chain had an expired cert" = "Chuỗi có chứng chỉ hết hạn";

/* Title for button to change encrypted database passphrase */
"Change Passphrase" = "Change Passphrase";

/* Title for chat view */
"Chat" = "Chat";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Chat an toàn với tôi ";

/* Title for chats view */
"Chats" = "Chats";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Xem mã nguồn trên Github";

/* SSL error message */
"Cipher Suite negotiation failure" = "Thương lượng Bộ Mật Mã thất bại";

/* Label for text field where you compose a new message */
"Compose" = "Compose";

/* SSL error message */
"Configuration error" = "Có lỗi cấu hình";

/* Button label for connecting a Facebook account */
"Connect Facebook" = "Kết nối đến Facebook";

/* Label for button to create account by logging into an existing account */
"Connect to Existing Account" = "Kết nối vào Tài khoản Có sẵn";

/* Whether or not account is logged in */
"Connected" = "Kết nối vào";

/* String to state if an account is progress of creating a connection */
"Connecting" = "Connecting";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "Kết nối vào Tor";

/* SSL error message */
"Connection closed gracefully" = "Kết nối đóng lại tốt đẹp";

/* SSL error message */
"Connection closed via error" = "Kết nối đóng lại có lỗi";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Sao";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Không lấy chìa khóa công cộng ra từ chứng chỉ";

/* Title for button to create account */
"Create" = "Tạo";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Tạo Tài Khoản Mới";

/* Start of sentence that will be followed by names */
"Created by" = "Created by";

/* Title for progress of creating a new account */
"Creating Account" = "Đang tạo tài khoản";

/* title label for the existing passphrase */
"Current Passphrase" = "Current Passphrase";

/* SSL error message */
"Decoding error" = "Có lỗi giải mã";

/* SSL error message */
"Decompression failure" = "Giải nén thất bại";

/* SSL error message */
"Decryption error" = "Có lỗi giải mã";

/* SSL error message */
"Decryption failed" = "Giải mã thất bại";

/* SSL error message */
"Decryption failure" = "Giải mã thất bại";

/* default string to revert to normal language behaviour */
"Default" = "Mặc định";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Xóa tài khoản?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Xóa chat khi rời.";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Đã được gửi đi";

/* button label for disconnecting Facebook account */
"Disconnect Facebook" = "Ngắt kết nối khỏi Facebook";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Đừng Quấy Rầy";

/* Error message when domain textfield left blank */
"Domain needs to be set" = "Domain needs to be set";

/* Message when port is changed but domain not set */
"Domain needs to be set manually when specifying a custom port" = "Cần điền vào tên miền khi tự chọn cổng";

/* Title for donation link */
"Donate" = "Biếu";

/* Title for button to press when user is finished */
"Done" = "Xong";

/* Error title when there is a duplicate account */
"Duplicate account" = "Duplicate account";

/* The string describing account name or email address for a buddy */
"Email" = "Email";

/* string for decription yes/no setting for allowing opportunistic otr */
"Enables opportunistic OTR" = "Cho OTR";

/* Generic title for encryption errors */
"Encryption Error" = "Encryption Error";

/* title label for error when creating account */
"Error Creating Account" = "Error Creating Account";

/* Error message when registration fails */
"Error Registering Username" = "Có lỗi Đăng ký Tên người dùng";

/* Title of error message pop-up box */
"Error!" = "Xảy ra lỗi!";

/* SSL error message */
"Export restriction" = "Giới hạn của xuất";

/* Default message when a user status is set to extended away */
"Extended Away" = "Vắng Mặt Lâu";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Không nối kết với máy chủ XMPP được. Xin vui lòng xem lại dữ kiện đăng nhập, đường dây Internet và thử lại.";

/* SSL error message */
"Fatal alert" = "Cảnh giác nghiêm trọng";

/* your fingerprint */
"Fingerprint for you" = "Vân tay cho bạn";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Forgot Passphrase?";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* SSL error message */
"Handshake failure" = "Bắt tay thất bại";

/* Label for button to open link to translate app */
"Help Translate" = "Help Translate";

/* Label text for hostname field on login scree */
"Hostname" = "Tên máy chủ";

/* SSL error message */
"I/O would block (not fatal)" = "I/O bị chận (không nghiêm trọng)";

/* SSL error message */
"Illegal parameter" = "Thông số không hợp lệ";

/* Message alerting user that they need to return to the home screen and force close ChatSecure */
"In order to change languages return to the home screen and remove ChatSecure from the recently used apps" = "Để thay đổi ngôn ngữ hiển thị hãy trở về màn hình chính và gỡ bỏ ChatSecure khởi các ứng dụng đang được chạy";

/* Short for information, button title to get more information */
"Info" = "Thông tin";

/* Shown when starting an encrypted chat session */
"Initiate Encrypted Chat" = "Khởi động chat có mã hóa";

/* SSL error message */
"Insufficient buffer provided" = "Cung cấp không đủ bộ đệm ";

/* SSL error message */
"Insufficient security" = "Không đủ an toàn";

/* SSL error message */
"Internal error" = "Có lỗi bên trong";

/* SSL error message */
"Invalid certificate chain" = "Chuỗi chứng chỉ không hợp lệ";

/* title label for invalid email */
"Invalid Email" = "Invalid Email";

/* Directions to the system software update */
"iOS Vulnerability" = "Lổ hổng an ninh của iOS";

/* Message shown in line for users that are available */
"is now available" = "đã có mặt";

/* Message shown in line for users that are away */
"is now away" = "đã rời ";

/* Message shown in line for users that are offline */
"is now offline" = "đã offline";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Jabber (XMPP)";

/* string to bring up language selector */
"Language" = "Ngôn ngữ ";

/* String of title to alert user language is change */
"Language Change" = "Đổi ngôn ngữ ";

/* log in to account */
"Log In" = "Đăng nhập";

/* log out from account */
"Log Out" = "Đăng xuất";

/* shown during the login process */
"Logging in..." = "Đang đăng nhập....";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Đăng nhập Tự động";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "Manage ChatSecure Push account";

/* Subtitle lable for button to show saved fingerprints */
"Manage OTR fingerprints" = "Quản trị dấu tay OTR";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Quản trị chứng chỉ SSL đã lưu";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it.";

/* SSL error message */
"Miscellaneous bad certificate" = "Chứng chỉ xấu linh tinh";

/* SSL error message */
"Module attach failure" = "Ráp môđun vào thất bại";

/* The string describing a buddy's display name */
"Name" = "Tên";

/* For a new settings value */
"New" = "Mới";

/* Title for New Account View */
"New Account" = "Tài khoản mới";

/* title label for the new passphrase */
"New Passphrase" = "New Passphrase";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "Chứng chỉ SSL Mới";

/* Label for button to go to next step */
"Next" = "Next";

/* SSL error message */
"No Error" = "Không có lỗi";

/* SSL error message */
"No renegotiation allowed" = "Không cho phép thương lượng lại";

/* To let the user know the fingerprint as not been checked */
"Not Verified" = "Chưa phối kiểm";

/* Label in buddy list for users that are offline */
"Offline" = "Offline";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Cũ";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Open in Chrome";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Open in Facebook";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Open in Twitter";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Tùy ý";

/* the name for AIM */
"OSCAR Instant Messenger" = "OSCAR Instant Messenger";

/* Title for other miscellaneous settings group */
"Other" = "Khác";

/* Lable for button to show saved fingerprints */
"OTR Fingerprints" = "Dấu tay OTR";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "Our policy requires encryption but we are trying to send an unencrypted message out.";

/* Label text for password field on login screen */
"Password" = "Mật khẩu";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "Chứng chỉ đầu bên kia hợp lệ, hoặc bị lờ đi nếu tắt kiểm chứng";

/* SSL error message */
"Peer dropped connection before responding" = "Đầu bên kia rớt kết nối trước khi hồi âm";

/* SSL error message */
"Peer host name mismatch" = "Tên máy chủ không khớp";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Chờ Chấp Thuận";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Xóa vĩnh viễn";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Chứng chỉ được ghìm";

/* detail title label for invalid email */
"Please choose a valid email address" = "Please choose a valid email address";

/* Error description when account is disconnected while managing requests */
"Please log into this account before managing requests." = "Please log into this account before managing requests.";

/* Label for port number field for connecting to service */
"Port" = "Cổng";

/* the alleged fingerprint of their other person */
"Purported fingerprint for" = "Vân tay được cho là của";

/* Title for push-messaging related settings */
"Push" = "Push";

/* Label for qr code image */
"QR code" = "QR code";

/* Error string for OTR message string */
"Received a general OTR error." = "Received a general OTR error.";

/* Error string for OTR message string */
"Received a heartbeat." = "Received a heartbeat.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Received an encrypted message but cannot read it because no private connection is established yet.";

/* Error string for OTR message string */
"Received an unencrypted message." = "Received an unencrypted message.";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Received and discarded a message intended for another instance.";

/* Error string for OTR message string */
"Received our own OTR messages." = "Received our own OTR messages.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Gần đây";

/* SSL error message */
"Record overflow" = "Bị tràn dữ kiện";

/* Button title to reject a request such as a buddy request */
"Reject" = "Từ chối";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Remember Passphrase";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Nhớ mật khẩu";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Xóa bỏ";

/* Reply to an incoming message */
"Reply" = "Trả lời";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Cần có";

/* Label for text input for XMPP resource */
"Resource" = "Nguồn";

/* Title for button for saving a setting */
"Save" = "Lưu trữ";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Chứng chỉ được lưu lại";

/* Label for text field where you search for a buddy */
"Search" = "Search";

/* Title heading in settings */
"Security" = "An Ninh";

/* Title of alert box warning about security issues */
"Security Warning" = "Cảnh báo an ninh";

/* string for settings to allow self signed SSL string */
"Self Signed SSL" = "SLL Tự Ký";

/* String on button to email feedback */
"Send Feedback" = "Gửi Góp Ý";

/* Error string for OTR message string */
"Sent a heartbeat." = "Sent a heartbeat.";

/* SSL error message */
"Server closed session with no notification" = "Máy chủ đóng phiên lại mà không có thông báo";

/* SSL error message */
"Server has requested a client cert" = "Máy chủ yêu cầu chứng chỉ của khách";

/* Detail label for button to change encrypted database passphrase */
"Set new database passphrase" = "Set new database passphrase";

/* Title for the Settings screen */
"Settings" = "Cấu hình";

/* Directions to the system software update */
"Settings -> General -> Software Update" = "Thiết đặt -> Tổng quát -> Cập nhật Phần mềm";

/* Title for sharing a link to the app */
"Share" = "Chia sẻ";

/* Title for setting about showing a warning before disconnection */
"Sign out Warning" = "Cảnh báo về đăng xuất";

/* title label for signing up for a new account */
"Sign Up" = "Sign Up";

/* Label for button to skip this step */
"Skip" = "Skip";

/* string for settings to allow SSL mismatch */
"SSL Hostname Mismatch" = "Tên máy chủ SSL không trùng";

/* SSL error message */
"SSL protocol error" = "Có lỗi giao thức SSL";

/* Title of view where you can mange buddy or subscription requests */
"Subscription Requests" = "Yêu cầu đăng ký theo dõi";

/* Title to let user know that encryption is not currently enabled */
"The conversation is not secure" = "Cuộc trò chuyện này không an toàn";

/* Title to let user know that the OTR fingerprint has not been checked */
"The conversation is secure and the fingerprint is verfied" = "Cuộc trò chuyện được an toàn và dấu tay đã được kiếm chứng";

/* Warn user that the current chat is no longer secure */
"The conversation with %@ is no longer secure." = "Cuộc đối thoại với %@ không còn an toàn nữa.";

/* shown when changing database passphrase succeeds */
"The database passphrase change was successful." = "The database passphrase change was successful.";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has changed and needs to be verified" = "Dấu tay đã đổi và cần được kiểm chứng";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has not been verified" = "Dấu tay chưa được kiểm chứng";

/* Error string for OTR message string */
"The message received contains malformed data." = "The message received contains malformed data.";

/* Error string for OTR message string */
"The previous message was resent." = "The previous message was resent.";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "Máy chủ XMPP không hỗ trợ đăng ký trong-băng tần";

/* Error message when there is a duplicate account */
"There already exists an account with this username." = "There already exists an account with this username.";

/* Warns user that the current chat is secure */
"This chat is secured" = "Chat này an toàn.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "This device doesn't seem to be configured to make payments.";

/* Instructions label text underneath QR code */
"This QR Code contains a link to http://omniqrcode.com/q/chatsecure and will redirect to the App Store." = "Mã QR này chứa đường dẫn đến http://omniqrcode.com/q/chatsecure và sẽ chuyển hướng qua App Store.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Tor là một tính năng thử nghiệm, xin dùng trong sự cẩn trọng.";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* SSL error message */
"Underlying cryptographic error" = "Có lỗi mật mã nền";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Dữ kiện bất ngờ (cách quảng) trong DTLS";

/* SSL error message */
"Unexpected message received" = "Nhận thông tin bất ngờ";

/* SSL error message */
"Unknown Cert Authority" = "Thẩm quyền Chứng chỉ Không rõ";

/* SSL error message */
"Unknown certificate" = "Chứng chỉ không rõ";

/* Label for button to unlock app */
"Unlock" = "Unlock";

/* SSL error message */
"User canceled" = "Người dùng hủy bỏ";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "Tên người dùng";

/* SSL error message */
"Valid cert chain, untrusted root" = "Chuỗi chứng chỉ hợp lệ, root không tín cẩn";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Chứng chỉ Hợp lệ";

/* To let the user know the fingerprint as been checked */
"Verified" = "Đã phối kiểm";

/* Shown when verifying fingerprints */
"Verify" = "Kiểm";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Xác nhận vân tay";

/* Shown when verifying fingerprints */
"Verify Later" = "Phối kiểm sau";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Phiên bản";

/* Warn user that the current chat is not secure */
"Warning: This chat is not encrypted" = "Cảnh báo: chat này không có mã hóa";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Bạn muốn kết nối vào trang UserVoice để góp ý kiến phản hồi?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* Inform user that they must be secure their conversation before doing that action */
"You must be in a secure conversation first." = "Bạn phải có trong đối thoại an toàn trước.";

/* error message shown when user doesn't fill in a username or password */
"You must enter a username and a password to login." = "Bạn phải điền vào tên đăng nhập và mật khẩu";

/* Alert to system issues, leave in the %@ */
"Your current iOS system version (%@) contains a serious security vulnerability. Please update to the latest version as soon as possible." = "Phiên bản hệ điều hành iOS hiện thời (%@) có lổ hổng an ninh nghiêm trọng. Xin vui lòng cập nhật lên phiên bản mới nhất càng sớm càng tốt.";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "Tiền tặng của bạn giúp tài trợ việc soạn thảo ChatSecure";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history.";

